id: pwpolicy_account_lockout_timeout_enforce
title: "Set Account Lockout Time to 15 Minutes"
discussion: |
  The macOS _MUST_ be configured to enforce a lockout time period of at least 15 minutes when the maximum number of failed logon attempts is reached.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'minutesUntilFailedLoginReset = 15' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84810-1
  cci: 
    - CCI-002238
  800-53r4: 
    - AC-7
  srg: 
    - SRG-OS-000329-GPOS-00128
  disa_stig: 
    - AOSX-15-000021
  800-171r2:
    - 3.1.8
  cjis:
    - 5.5.3
macOS:
  - "10.15"
tags:
  - cjis
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: 15
