id: sysprefs_find_my_disable
title: "Disable Find My Service"
discussion: |
  The Find My service _MUST_ be disabled.

  A Mobile Device Management (MDM) solution _MUST_ be used to carry out remote locking and wiping instead of Apple’s Find My service.
 
  Apple’s Find My service uses a personal AppleID for authentication. Organizations should rely on MDM solutions, which have much more secure authentication requirements, to perform remote lock and remote wipe.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '(allowFindMyDevice = 0|allowFindMyFriends = 0|DisableFMMiCloudSetting = 1)'
result:
  integer: 3
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84831-7
  cci: 
    - N/A
  800-53r4: 
    - CM-7
    - AC-20
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.20
    - 3.4.6
  iso27001:
    - A.11.2.6
    - A.13.1.1
    - A.13.2.1
    - A.12.5.1*
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFindMyDevice: false
    allowFindMyFriends: false
  com.apple.icloud.managed:
    DisableFMMiCloudSetting: true
  
