id: sysprefs_ad_tracking_disable
title: "Disable Ad Tracking"
discussion: |
  Ad tracking and targeted ads _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users’ interests and deliver targeted advertisements.  
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'forceLimitAdTracking = 1;'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84822-6
  cci: 
    - N/A
  800-53r4: 
    - AC-20
    - CM-7
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - 3.1.20
    - 3.4.6
  iso27001:
    - A.11.2.6
    - A.13.1.1
    - A.13.2.1
    - A.12.5.1*
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.AdLib:
    forceLimitAdTracking: true
