id: os_airdrop_disable
title: "Disable AirDrop"
discussion:   
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  
  AirDrop allows users to share and receive files from other nearby Apple devices. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'DisableAirDrop = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85293-9
  cci: 
    - CCI-000381
  800-53r4:
    - CM-7
    - AC-3
    - AC-18
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - AOSX-15-002009
  800-171r2:
    - 3.1.1
    - 3.1.2
    - 3.1.16
    - 3.1.20
    - 3.4.6
  csf:
    - ID.AM-4
    - PR.AC-3
    - PR.AC-4
    - PR.IP-1
    - PR.PT-3
    - PR.PT-4
macOS:
  - "11.0"
tags:
  - csf
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
