id: os_gatekeeper_enable
title: "Enable Gatekeeper"
discussion: |
  Gatekeeper _MUST_ be enabled. 

  Gatekeeper is a security feature that ensures that applications are digitally signed by an Apple-issued certificate before they are permitted to run. Digital signatures allow the macOS host to verify that the application has not been modified by a malicious third party.

  Administrator users will still have the option to override these settings on a case-by-case basis.
check: | 
  /usr/sbin/spctl --status | /usr/bin/grep -c "assessments enabled"
result:
  integer: 1
fix: |
  [source,bash]
  ----
  /usr/sbin/spctl --master-enable
  ----
references:
  cce:
    - CCE-84759-0
  cci: 
    - CCI-001749
  800-53r4: 
    - CM-5(3)
    - CM-5
    - SI-3
    - SI-7(15)
  srg: 
    - SRG-OS-000366-GPOS-00153
  disa_stig: 
    - AOSX-14-002064
  800-171r2:
    - 3.4.5
  iso27001:
    - A.9.2.3
    - A.9.4.5
    - A.12.1.2
    - A.12.1.4
    - A.12.5.1
    - A.12.2.1
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.control:
    EnableAssessment: true
