id: os_handoff_disable
title: "Disable Handoff"
discussion: |
  Handoff _MUST_ be disabled. 

  Handoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'allowActivityContinuation = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84763-2
  800-53r4:
    - AC-3
    - AC-20
    - CM-7
  disa_stig:
    - N/A
  srg: 
    - N/A
  cci: 
    - N/A    
  800-171r2:
    - 3.1.1
    - 3.1.2
    - 3.1.20
    - 3.4.6
  iso27001:
    - A.6.2.2
    - A.9.1.2
    - A.9.4.1
    - A.9.4.4
    - A.9.4.5
    - A.13.1.1
    - A.14.1.2
    -  A.14.1.3
    - A.18.1.3
    - A.11.2.6
    - A.13.1.1
    - A.13.2.1
    - A.12.5.1*
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
