id: os_internet_accounts_prefpane_disable
title: "Disable the Internet Accounts System Preference Pane"
discussion: |
  The Internet Accounts System Preference pane _MUST_ be disabled to prevent the addition of unauthorized internet accounts.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.internetaccounts'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84767-3
  cci: 
    - CCI-001774
  800-53r4: 
    - AC-20
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-14-002032
  800-171r2:
    - 3.1.20
  iso27001:
    - A.11.2.6
    - A.13.1.1
    - A.13.2.1
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.internetaccounts
