id: os_messages_app_disable
title: "Disable Messages App"
discussion: |
  The macOS built-in Messages.app _MUST_ be disabled. 

  The Messages.app establishes a connection to Apple’s iCloud service, even when security controls to disable iCloud access have been put in place. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -A 20 familyControlsEnabled | /usr/bin/grep -c "/Applications/Messages.app"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84770-7
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4:
    - CM-7
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig:
    - AOSX-14-002011
  800-171r2:
    - 3.1.20
    - 3.4.6
  iso27001:
    - A.11.2.6
    - A.13.1.1
    - A.13.2.1
    - A.12.5.1*
macOS:
  - "10.15"
tags:
  - iso27001
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - STIG
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList: 
      - /Applications/Messages.app
