id: os_mail_app_disable
title: "Disable Mail App"
discussion: |
  The macOS built-in Mail.app _MUST_ be disabled. 
  
  The Mail.app contains functionality that can establish connections to Apple’s iCloud, even when security controls to disable iCloud access have been put in place.
  
  [IMPORTANT]
  ====
  Some organizations allow the use of the built-in Mail.app for organizational communication. Information System Security Officers (ISSOs) may make the risk-based decision not to disable the macOS built-in Mail.app to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |  
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -A 20 familyControlsEnabled | /usr/bin/grep -c "/Applications/Mail.app"
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-84769-9
  cci: 
    - CCI-000381
  800-53r4:
    - CM-7
    - AC-20
  srg:
    - SRG-OS-000095-GPOS-00049
  disa_stig:
    - AOSX-15-002019
  800-171r2:
    - 3.1.20
    - 3.4.6
  cjis:
    - 5.7.1.1
    - 5.10.1
    - 5.10.1.1
macOS:
  - "10.15"
tags:
  - cjis
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList: 
      - /Applications/Mail.app
