id: icloud_appleid_prefpane_disable
title: "Disable the System Preference Pane for Apple ID"
discussion: |
  The system preference pane for Apple ID _MUST_ be disabled.

  Disabling the system preference pane prevents login to Apple ID and iCloud. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.AppleID'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85283-0
  cci: 
    - CCI-000381
    - CCI-001774
  800-53r4: 
    - CM-7
    - AC-20
    - AC-20(1)
  srg: 
    - SRG-OS-000095-GPOS-00049
    - SRG-OS-000370-GPOS-00155
  disa_stig: 
    - AOSX-15-002018
  800-171r2:
    - 3.1.20
    - 3.4.6
  csf:
    - ID.AM-4
    - PR.AC-3
    - PR.IP-1
    - PR.PT-3
macOS:
  - "11.0"
tags:
  - csf
  - 800-171
  - cnssi-1253
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes: 
      - com.apple.preferences.AppleIDPrefPane
